<template>
  <div class="introview-container">
    <h1 class="h3 mt-4">项目简介</h1>
    <hr />
    <div class="mt-4 pl-2 content">
      <p>
        <strong>周杰伦（Jay Chou）</strong>
        ，1979年1月18日出生于台湾省，祖籍福建省福建省泉州市永春县，中国台湾流行乐男歌手、音乐人、演员、导演、编剧，曾获金马奖、金像奖最佳新人奖、金曲奖最佳作曲人奖，连续三年获世界音乐大奖中国区最畅销艺人奖，曾于2003年成为美国《时代周刊》封面人物，2012年登福布斯中国名人榜榜首。周杰伦于2000年发布第一张个人专辑《Jay》正式出道，出道至今已发布27张专辑，300多首歌曲，《七里香》、《听妈妈的话》、《青花瓷》等耳熟能详的歌曲陪伴一代又一代人的青春岁月。
      </p>
      <p>
        本项目尝试对周杰伦出道以来参与过的所有歌曲作品、专辑以及合作歌手、作词人进行关系分析，将这些信息组织成三元组构建知识图谱，并基于知识图谱实现一个有关周杰伦歌曲的在线检索系统。
      </p>
      <p>
        我们首先利用爬虫技术爬取有关周杰伦歌曲信息的文本描述，利用知识图谱抽取工具DeepKE抽取文本描述中的实体和关系，并将这些信息组织成三元组存入.csv格式文件中，然后使用非关系型数据库neo4j搭建知识图谱。最后，我们基于python的轻量级后端开发框架flask和前端框架Vue实现了一个基于知识图谱的在线检索系统。
      </p>
    </div>
  </div>
</template>

<script>
export default {}
</script>

<style lang="less" scoped>
.content {
  margin-left: 10px;
  width: 90%;
  text-indent: 2rem;
}
</style>
